[
  { "bookTitle": "Range", "bookAuthor": "David Epstein", "inProgress": true },
  {
    "bookTitle": "Invisible Women - Exposing Data Bias in a World Designed for Men",
    "bookAuthor": "Caroline Criado Perez",
    "isItWorthReReading": true,
    "summary": "A fascinating book that explores how the world we live in often overlooks the needs and experiences of half its population — women. It uncovers the ways in which the design of everyday things, policies, and systems can unintentionally discriminate against women, making them invisible in various aspects of life. The book starts by talking about something called the \"default male.\" Imagine a world where people assume everyone is like a boy or a man. This happens a lot in the things around us, like the size of car seats or the design of smartphones. The default male thinking leaves out the differences that make girls and women unique.The next chapter explains how women often go unnoticed in data and research. Imagine playing hide-and-seek, and the seekers don't even know you're playing. This is what happens to women in studies and statistics, making it hard to understand their needs and experiences. Next, buildings, streets, and public spaces are covered. All these are designed with the \"default male\" in mind. This can create problems for women who might feel unsafe or find it difficult to navigate the environment. The chapter talks about how making things more inclusive can make the world better for everyone. Then Perez talks about how many things, from medicine to technology, are designed based on data that mainly comes from men. This can lead to products and services that don't work as well for women. Furthermore, sometimes, important work that women do, like taking care of the family or doing household chores, isn't counted or recognized. She talks about how recognizing women's work is important for making things fair. Further, Perez shows how women often end up paying more for things like personal care products or clothes. Understanding these inequalities helps us work towards fairness. Health, anotehr topic that Caroline Criado Perez talks about, is crucial for everyone, but this chapter explains how medical research and treatments have historically focused more on men. This often leads to health issues being overlooked in women. Did you know that car safety tests are often done with a male dummy? Perez covers how this can be dangerous for women because their bodies are different. Finally, she discusses how climate change affects women and men differently. Recognizing these differences helps us find fair solutions. \"Invisible Women\" ends by encouraging us to think about how we can make the world more equal. It's like playing a game where everyone has the same chances and nobody feels left out. By understanding and fixing the ways women are made invisible, we can create a world that works better for everyone, regardless of gender."
  },
  {
    "bookTitle": "Good Economics for Hard Times",
    "bookAuthor": "Abhijit V. Banerjee, Esther Duflo",
    "isItWorthReReading": true,
    "summary": "A book that explores big problems in the world and suggests practical solutions using simple language. Imagine you have a big puzzle, and the world is like that puzzle. Abhijit and Esther, the authors, are like puzzle masters. They look at different pieces of the puzzle, like why some people are rich and others are not, or why some countries have a lot of money while others struggle. One of the first puzzles they tackle is about immigration. Imagine people from one place moving to another. Some worry that immigrants take jobs away, but Abhijit and Esther say, \"Hold on! It's not that simple.\" They show how immigrants can actually create more jobs and help the economy. It's like saying, \"When more friends come to play, everyone can have more fun!\" Now, let's talk about money. The authors ask, \"Why do some countries have a lot of money, and others don't?\" They explain that it's not just about having more stuff. It's also about how fair the system is. Imagine you're playing a game, and one person keeps changing the rules to win. That's not fair, right? Abhijit and Esther talk about making the rules fair for everyone, so the game (or the economy) works better. They also look at jobs and why some people have a hard time finding work. The authors suggest that we can make more spots available by helping everyone get the right skills. Next, they explore the big topic of inequality. Abhijit and Esther talk about ways to make sure everyone gets a piece of the pie, not just a few people. The authors also dive into climate change. They say we need to find ways to use energy that won't harm the planet. Health is another piece of the puzzle. Abhijit and Esther talk about how important it is for everyone to be healthy. The authors suggest ways to make sure everyone can be part of the fun. They also touch on education, like the ABCs of life. Abhijit and Esther believe that if we all learn and understand better, we can solve more puzzles together. In the end, the authors want us to think about the world and its puzzles with open minds. They believe that by working together and being fair, we can solve these puzzles and make the world a better place for everyone. So, \"Good Economics for Hard Times\" is like a friendly guide to understanding the big puzzles of the world and finding smart solutions that make life better for everyone. It's not about making things more complicated; it's about making things more fair, like playing a game where everyone has a chance to win."
  },
  {
    "bookTitle": "The Body",
    "bookAuthor": "Bill Bryson",
    "yearWhenLastFinishedReading": "2023",
    "summary": "A captivating exploration of the human body, unraveling its mysteries with wit, humor, and an accessible style that even a non-native English speaker can grasp. Bryson takes readers on a fascinating journey through the intricacies of our anatomy, explaining complex biological concepts in a way that is both informative and entertaining. Bryson breaks down the science of the human body into digestible chunks, making it an engaging read for those unfamiliar with advanced medical terminology. The author delves into the historical context of our understanding of the body, highlighting key moments and discoveries that have shaped modern medicine. He seamlessly weaves together scientific facts, anecdotes, and personal reflections, creating a narrative that is not only educational but also deeply human. He explores various aspects of the body, including the brain, heart, immune system, and more, providing a holistic view of our biological marvel. Moreover, Bryson addresses the peculiarities and quirks of the human body, showcasing its resilience, adaptability, and occasional eccentricities. Whether discussing the intricacies of DNA or the importance of sleep, he connects the scientific details to real-world implications, making the information relevant and relatable. \"The Body\" is not just a biology lesson, it's a celebration of the remarkable vessel that houses our existence. Bryson delves into the ways our bodies have evolved over time, adapting to diverse environments and challenges. He explores the impact of lifestyle choices on our health, shedding light on the delicate balance that sustains life. From the influence of bacteria in our gut to the marvels of the human skeleton, Bryson paints a vivid picture of our physical selves. The book also delves into the history of medical advancements and the individuals who played pivotal roles in shaping our understanding of the body's intricacies. Bryson's narrative skillfully integrates scientific facts with anecdotes, ensuring that readers, regardless of their language background, can appreciate the marvels of the human body. He demystifies complex topics, breaking them down into comprehensible explanations without sacrificing accuracy. Bryson's exploration of the body extends beyond the physical, touching on the interconnectedness of mental and emotional well-being. He discusses the role of hormones, neurotransmitters, and the brain in shaping our experiences and perceptions. Through engaging storytelling, Bryson fosters an appreciation for the body's resilience and the importance of taking care of it."
  },
  {
    "bookTitle": "Rationality",
    "bookAuthor": "Steven Pinker",
    "yearWhenLastFinishedReading": "2023",
    "summary": "\"Rationality\" by Steven Pinker explores the human capacity for reason and logic. Pinker, a renowned cognitive scientist, delves into the ways our brains process information and make decisions, unraveling the intricate mechanisms that underlie rational thought. Drawing upon a wealth of research from diverse fields such as psychology, economics, and philosophy, Pinker dismantles common misconceptions about human reasoning. He argues that despite our cognitive biases and occasional irrationalities, humans possess a remarkable ability for rational thinking, which has propelled advancements in science, technology, and civilization. Pinker dismantles the myth of the \"blank slate\" mind, demonstrating how evolution has shaped our cognitive toolkit. He delves into the concept of Bayesian reasoning, emphasizing the importance of updating beliefs based on new evidence. The book also explores the role of emotions in decision-making, illustrating how emotions can complement rather than hinder rationality. Pinker navigates through topics like probability, statistics, and cognitive illusions, providing readers with practical insights into improving their own rational thinking. The narrative is enriched with real-world examples, making complex concepts accessible to readers from all walks of life. Pinker emphasizes the importance of intellectual virtues such as curiosity, open-mindedness, and skepticism in fostering rationality. He advocates for a culture that values critical thinking and evidence-based reasoning, highlighting the societal benefits that stem from a rational approach to problem-solving. Throughout the book, Pinker encourages readers to embrace a rational mindset, recognising its power to enhance personal and collective well-being. In a world often clouded by misinformation and irrationality, \"Rationality\" serves as a beacon, guiding readers towards a clearer understanding of the cognitive processes that shape our thoughts and actions. Through engaging prose and compelling examples, Pinker celebrates the triumphs of human rationality while acknowledging its limitations, ultimately inspiring readers to cultivate a more rational and enlightened society."
  },
  {
    "bookTitle": "The Stuff of Thought",
    "bookAuthor": "Steven Pinker",
    "yearWhenLastFinishedReading": "2023",
    "summary": "\"The Stuff of Thought\" by Steven Pinker explores the intricate and fascinating world of language, delving into the depths of how words shape our thoughts and perceptions. Pinker takes readers on a captivating journey through the nuances of language, unraveling the complex threads that weave through our communication. He begins by dissecting the fundamental building blocks of language, examining how words and their meanings are interconnected in our minds. Pinker introduces the concept of \"mentalese,\" an abstract mental language that transcends the words we speak, providing insight into the cognitive processes underlying our linguistic abilities. The book explores the power of language to express an infinite array of thoughts, emotions, and concepts, showcasing the remarkable flexibility and creativity embedded in human communication. Pinker delves into the subtleties of linguistic phenomena, from metaphors and innuendos to the evolution of slang, shedding light on the rich tapestry of expression that defines human interaction. One of the book's central themes is the connection between language and thought, challenging readers to consider whether language merely reflects our thoughts or actively shapes them. Pinker tackles controversial topics such as political correctness, arguing that linguistic taboos can influence our perception of reality and hinder honest discourse. The author also explores the intriguing world of profanity, dissecting the psychology behind our use of taboo words and their impact on communication. As Pinker navigates through the landscape of language, he delves into the intricacies of grammar and syntax, providing a comprehensive understanding of how these elements contribute to the structure of our thoughts. The book takes an interdisciplinary approach, incorporating insights from psychology, neuroscience, and philosophy to unravel the mysteries of language and cognition. Pinker introduces the concept of the \"euphemism treadmill,\" illustrating how society's attempt to sanitize language often results in the reinvention of new euphemisms that carry the same underlying taboos. Throughout the narrative, Pinker peppers the discussion with anecdotes, examples, and wit, making the exploration of linguistic complexities both accessible and enjoyable. The book also addresses the universal nature of certain linguistic patterns, revealing how different cultures share commonalities in the way they structure their thoughts through language."
  },
  {
    "bookTitle": "The Better Angels of our Nature",
    "bookAuthor": "Steven Pinker",
    "yearWhenLastFinishedReading": "2023",
    "summary": "A comprehensive exploration of the decline of violence throughout human history. Pinker argues that, contrary to popular belief, our world has become less violent over time. The book is structured to reveal this decline through an analysis of historical trends, examining various forms of violence such as war, homicide, and torture. Pinker identifies several \"better angels\" or positive forces that have contributed to this decline, including the rise of empathy, reason, and the development of systems that encourage cooperation and discourage violence. He supports his arguments with a wealth of historical data, presenting a compelling case for the idea that, despite the persistence of violence in the media and the occasional large-scale conflict, humanity is on a trajectory towards a more peaceful coexistence. Pinker also tackles counterarguments and addresses common misconceptions about violence, offering a nuanced and well-reasoned perspective. The book is not only an analysis of the past but also a call to understand and appreciate the progress that has been made in creating a more peaceful world. Pinker encourages readers to continue fostering the better angels within themselves and society, ultimately providing a hopeful outlook on the future of human civilization."
  },
  {
    "bookTitle": "The Illusion of Choice",
    "bookAuthor": "Richard Shotton",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Software Architecture Patterns",
    "bookAuthor": "Mark Richards",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Who Moved My Cheese",
    "bookAuthor": "Dr Spencer Johnson",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Business @ The Speed of Thought",
    "bookAuthor": "Bill Gates",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "21 Lessons for the 21st Century",
    "bookAuthor": "Yuval Noah Harari",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "The Obstacle is the Way",
    "bookAuthor": "Ryan Holiday",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Noise",
    "bookAuthor": "Daniel Kahneman, Olivier Sibony, Cass R. Sunstein",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Hackers and Painters",
    "bookAuthor": "Paul Graham",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Purple Cow",
    "bookAuthor": "Seth Godin",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "The Moment of Lift",
    "bookAuthor": "Melinda Gates",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Potato",
    "bookAuthor": "John Reader",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Seeking Wisdom - From Darwin to Munger",
    "bookAuthor": "Peter Bevelin",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Trick or Treatment",
    "bookAuthor": "Simon Singh",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Only the Paranoid Survive",
    "bookAuthor": "Andrew Grove",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Applied Artificial Intelligence",
    "bookAuthor": "Mariya Yao",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Sapiens",
    "bookAuthor": "Yuval Noah Harari",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Homo Deus",
    "bookAuthor": "Yuval Noah Harari",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Thinking, Fast and Slow",
    "bookAuthor": "Daniel Kahneman",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "How to be Perfect",
    "bookAuthor": "Michael Schur",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "The Good Place and Philosophy",
    "bookAuthor": "William Irwin",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "The Power of Ethics",
    "bookAuthor": "Susan Liautaud and Lisa Sweetingham",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "A Mind for Numbers",
    "bookAuthor": "Barbara Oakley",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Remote - Office Not Required",
    "bookAuthor": "David Heinemeier Hansson",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Do Nothing",
    "bookAuthor": "Celeste Headlee",
    "yearWhenLastFinishedReading": "2023"
  },
  {
    "bookTitle": "Weapons of Math Destruction",
    "bookAuthor": "Cathy O'Neil",
    "yearWhenLastFinishedReading": "2023",
    "summary": "Algorithms are everywhere, from deciding which videos you might like on the internet to helping banks decide who gets a loan. But here's the catch: not all algorithms are \"good\". Some are like villains in disguise, and Cathy O'Neil calls them \"Weapons of Math Destruction\" or WMDs. Just like how a superhero can accidentally cause chaos, these WMDs can mess up people's lives without anyone realizing it. One WMD example is when algorithms decide who gets a job interview. If these algorithms are not carefully designed, they might end up favoring certain people over others, like only choosing people who live in a certain neighborhood or went to a specific school. That's not fair! Algorithms should be fair and treat everyone equally. But some WMDs don't follow this rule. They can unintentionally create unfair situations, especially for those who are already facing challenges. If algorithms are not accurate, they might label things incorrectly. If the algorithm is biased, it might unfairly reject some people or charge them more money just because of where they live or their background. One important thing to understand is that these WMDs are not evil on purpose. They're like well-meaning robots that sometimes make mistakes. Cathy O'Neil wants people to pay attention and make sure these algorithms are fair and don't unintentionally hurt anyone. By understanding how these algorithms work and demanding fairness, we can make the world a better place."
  },
  {
    "bookTitle": "Predictably Irrational",
    "bookAuthor": "Dan Ariely",
    "yearWhenLastFinishedReading": "2022",
    "summary": "The book explores the fascinating realm of human decision-making, revealing the systematic patterns of irrationality that govern our choices. Ariely, a behavioral economist, delves into the irrational aspects of our behavior and provides insightful explanations for seemingly irrational decisions. He challenges the conventional belief that people always act in their best interest, demonstrating that our choices are often influenced by predictable cognitive biases. Ariely introduces the concept of \"predictable irrationality\" to explain how we consistently deviate from rational decision-making due to cognitive shortcuts and emotional influences. Through a series of engaging experiments and real-life examples, Ariely highlights various cognitive biases, such as the decoy effect, anchoring, and the power of free offers, that consistently shape our choices. The book explores topics like the relativity of value, social norms, and the impact of expectations on our perception of experiences. One of the key takeaways is that understanding our irrational tendencies can empower us to make better decisions. Ariely also addresses the role of dishonesty in human behavior, uncovering the factors that lead people to cheat and lie. The book concludes by emphasizing the importance of designing systems and policies that consider the predictable irrationality of individuals. Overall, \"Predictably Irrational\" provides a captivating journey into the quirks of human decision-making, offering valuable insights for individuals, businesses, and policymakers alike to navigate the complexities of our irrational minds."
  },
  {
    "bookTitle": "The Language Instinct",
    "bookAuthor": "Steven Pinker",
    "yearWhenLastFinishedReading": "2022",
    "summary": "\"The Language Instinct\" is an enlightening and accessible exploration of the profound and instinctive nature of human language, providing a compelling argument for the biological basis of this unique human capacity. It explores the fascinating world of human language in a captivating journey through linguistics. The book delves into the core idea that language is an innate human instinct, a natural ability embedded in our genes. He challenges the common belief that language is a cultural artifact, arguing that it is a biological adaptation shaped by natural selection. Pinker elucidates complex linguistic concepts with clarity and wit, making the subject accessible to readers from all backgrounds. The book examines the intricate mechanics of language, from phonetics to grammar, shedding light on the universal aspects that underpin the world's diverse languages. Pinker introduces the concept of the \"language organ,\" suggesting that the brain is hardwired for language, and he explores the role of genetics in shaping linguistic abilities. Drawing on a wealth of examples and studies, Pinker debunks myths about language acquisition, emphasising the ease with which children acquire complex linguistic structures. He contrasts the biological view with competing theories, providing a comprehensive overview of the ongoing debates in linguistics. Pinker also delves into the historical development of language, tracing its evolutionary roots and dispelling misconceptions about the supposed simplicity of early forms of communication. Throughout the book, Pinker employs a conversational style, employing humour and real-world examples to elucidate intricate linguistic theories. He addresses common questions about language evolution, such as the origin of grammar and the nature of linguistic universals. Pinker's exploration extends to the impact of technology on language, including the influence of writing systems and the advent of the internet. The book concludes with a reflection on the future of language, contemplating the potential evolution of new languages and dialects."
  },
  {
    "bookTitle": "The Blank Slate",
    "bookAuthor": "Steven Pinker",
    "yearWhenLastFinishedReading": "2022",
    "summary": "In \"The Blank Slate\" Steven Pinker advocates for a more balanced and scientifically informed approach to understanding human nature, challenging the simplistic views that have dominated discussions on the subject. The book is a thought-provoking exploration of the nature vs. nurture debate, dissecting the origins of human behaviour and intelligence. Pinker challenges the notion of the \"blank slate,\" the idea that humans are born with minds like empty canvases waiting to be shaped solely by experience and culture. Drawing on diverse disciplines such as psychology, genetics, and neuroscience, Pinker argues that our minds are not blank slates but rather products of a complex interplay between genes and environment. He dismantles the extreme ideologies that deny the role of biology in shaping human traits, advocating for a more nuanced understanding that considers both genetic and environmental factors. Pinker addresses controversial topics like intelligence, gender differences, and human violence, dismantling misconceptions and emphasising the importance of scientific evidence in understanding these phenomena. Throughout the book, he promotes a middle-ground perspective that acknowledges both the significance of biological predispositions and the impact of culture and education."
  },
  {
    "bookTitle": "How the Mind Works",
    "bookAuthor": "Steven Pinker",
    "yearWhenLastFinishedReading": "2022"
  },
  {
    "bookTitle": "Grit",
    "bookAuthor": "Angela Duckworth",
    "isItWorthReReading": true,
    "summary": "Imagine you're trying to build the tallest tower out of blocks. Grit is like having the determination and courage to keep building, even when it gets difficult or you make mistakes. Angela Duckworth tells us that having talent is good, but having grit is even more important. She says it's like a magical ingredient that helps us reach our goals. Grit is like having a superpower. It's not about being the smartest or the most talented. Instead, it's about working really, really hard and not giving up, even when things are tough. Duckworth found that grit is a big reason why some people succeed. Duckworth created something called the \"Grit Scale.\" It's like a quiz that helps us understand how gritty we are. It asks questions like, \"Do you finish what you begin?\" and \"Do setbacks make you want to give up?\" Your answers help you see how much grit you have. Duckworth says that effort counts twice. This means that it's not just about being smart or talented. It's about putting in a lot of effort. Imagine you're learning to ride a bike. You might fall down a lot, but if you keep trying and don't give up, you'll eventually get better. Grit is a mix of passion and perseverance. Passion is like having a big dream or goal. Perseverance is about sticking with it, even when it gets tough. So, if you really love drawing and you practice every day, that's passion and perseverance working together. Duckworth also talks about the 10,000-hour rule, which is the idea that it takes about 10,000 hours of practice to become really, really good at something. This could be playing the piano, playing soccer, or anything else. So, if you want to be amazing at something, you need to practice a lot. Throughout the book, Duckworth shares stories about gritty people. These are real-life examples of how grit helped them succeed. For example, she talks about a famous basketball player who wasn't always the best, but he practiced a lot and became one of the greatest. Duckworth introduces the concept of a growth mindset. This means believing that you can get better at something if you work hard. If you think you can improve, you're more likely to have grit. So, if you're not good at math right now, a growth mindset says you can get better with practice. The book also explores how grit is important in school. Duckworth says that even if you're not the smartest, if you work hard and stay determined, you can do well. Gritty students keep trying, ask for help when needed, and don't give up easily. Duckworth discusses how parents and teachers can help kids develop grit. Encouraging children to pursue their passions, praising their effort instead of just their intelligence, and teaching them that mistakes are a part of learning are some of the ways to nurture grit. Finally, Duckworth suggests something called the \"Hard Thing Rule.\" It means each person in the family should pick something hard to do and stick with it. This helps everyone practice grit together. In a nutshell, \"Grit\" teaches us that success is not just about being naturally smart or talented. It's about working hard, sticking with our goals, and not giving up when things get tough. Grit is like a secret weapon that can help us become superheroes in our own lives. So, if you ever feel like giving up, just remember the power of grit!"
  },
  {
    "bookTitle": "The Personal MBA",
    "bookAuthor": "Josh Kaufman",
    "yearWhenLastFinishedReading": "2021",
    "summary": "A captivating journey into the world of business simplified for anyone, whether you're a child or new to the business realm. Imagine embarking on an adventure armed with a treasure map filled with easy-to-understand ideas. At its core, the book emphasizes that you don't need an expensive degree to navigate business successfully. It breaks down essential concepts, presenting them as 'big ideas' that are as clear as building blocks in a Lego castle. From creating value to understanding the human mind, the book unfolds the puzzle of business with simplicity. It unveils the power of systems, the art of negotiation, and the importance of marketing, likening these to magical tools for success. It encourages working smarter, not harder, and introduces the money game, transforming financial matters into a magical journey. Making wise decisions becomes a superpower, and the art of selling is akin to showcasing a special talent. In essence, \"The Personal MBA\" transforms intricate business concepts into a delightful adventure, making it accessible and enjoyable for everyone ready to explore the enchanted land of business."
  },
  {
    "bookTitle": "Freakonomics",
    "bookAuthor": "Steven D Levitt and Stephen J Dubner",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "SuperFreakonomics",
    "bookAuthor": "Steven D Levitt and Stephen J Dubner",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Think Like a Freak",
    "bookAuthor": "Steven D Levitt and Stephen J Dubner",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "The Undercover Economist",
    "bookAuthor": "Tim Harford",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "The Logic Of Life",
    "bookAuthor": "Tim Harford",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Messy",
    "bookAuthor": "Tim Harford",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "How to Make the World Add Up",
    "bookAuthor": "Tim Harford",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "You Are Now Less Dumb",
    "bookAuthor": "David McRaney",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Tools of Titans",
    "bookAuthor": "Timothy Ferriss",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "On Writing Well",
    "bookAuthor": "William Zinsser",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Guns, Germs, and Steel",
    "bookAuthor": "Jared Diamond",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Emotional Intelligence",
    "bookAuthor": "Daniel Goleman",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Algorithms to Live By",
    "bookAuthor": "Brian Christian and Tom Griffiths",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Never Eat Alone",
    "bookAuthor": "Keith Ferrazzi and Tahl Raz",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "The Ascent of Money",
    "bookAuthor": "Niall Ferguson",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Money - The True Story of a Made-Up Thing",
    "bookAuthor": "Jacob Goldstein",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Phishing for Phools",
    "bookAuthor": "George A. Akerlof and Robert J. Shiller",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Guide to Financial Markets",
    "bookAuthor": "Marc Levinson",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "The Complete Guide to Capital Markets for Quantitative Professionals",
    "bookAuthor": "Alex Kuznetsov",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Debt - The First 5.000 Years",
    "bookAuthor": "David Greber",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "How to Win Friends and Influence People in the Digital Age",
    "bookAuthor": "Dale Carnagie",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "The 7 Habits of Highly Effective People",
    "bookAuthor": "Stephen R. Coley",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "How To Be A Stoic",
    "bookAuthor": "David Dillinger",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "12 Rules for Life - An Antidote to Chaos",
    "bookAuthor": "Jordan B. Peterson",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Beyond Order - 12 More Rules for Life",
    "bookAuthor": "Jordan B. Peterson",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "The Lean Startup",
    "bookAuthor": "Eric Ries",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "Conscious",
    "bookAuthor": "Annaka Harris",
    "yearWhenLastFinishedReading": "2021"
  },
  {
    "bookTitle": "The 4-Hour Workweek",
    "bookAuthor": "Timothy Ferriss",
    "yearWhenLastFinishedReading": "2020"
  },
  {
    "bookTitle": "The Subtle Art of Not Giving a Fck",
    "bookAuthor": "Mark Manson",
    "yearWhenLastFinishedReading": "2020"
  },
  {
    "bookTitle": "Make Your Bed",
    "bookAuthor": "Admiral William H. McRaven",
    "yearWhenLastFinishedReading": "2020"
  },
  {
    "bookTitle": "The Psychology of Security",
    "bookAuthor": "Bruce Schneier",
    "yearWhenLastFinishedReading": "2019"
  },
  {
    "bookTitle": "The Art of Software Testing",
    "bookAuthor": "Glenford Myers",
    "yearWhenLastFinishedReading": "2019"
  },
  {
    "bookTitle": "The Pragmatic Programmer",
    "bookAuthor": "Andrew Hunt and David Thomas",
    "yearWhenLastFinishedReading": "2018"
  },
  {
    "bookTitle": "The Undoing Project",
    "bookAuthor": "Michael Lewis",
    "yearWhenLastFinishedReading": "2018"
  },
  {
    "bookTitle": "Man's Search for Meaning",
    "bookAuthor": "Viktor E. Frankl",
    "yearWhenLastFinishedReading": "2016"
  },
  {
    "bookTitle": "Hit Refresh",
    "bookAuthor": "Satya Nadella",
    "wishlisted": true
  },
  {
    "bookTitle": "How to Avoid a Climate Disaster",
    "bookAuthor": "Bill Gates",
    "wishlisted": true
  },
  { "bookTitle": "Quiet", "bookAuthor": "Susan Cain", "wishlisted": true },
  {
    "bookTitle": "Fragile by Design",
    "bookAuthor": "Charles Calomiris, Stephen haber",
    "wishlisted": true
  },
  {
    "bookTitle": "Idiot Brain",
    "bookAuthor": "Dean Burnett",
    "wishlisted": true
  },
  {
    "bookTitle": "The Efficiency Paradox",
    "bookAuthor": "Edward Tenner",
    "wishlisted": true
  },
  {
    "bookTitle": "What the Dog Saw",
    "bookAuthor": "Malcolm Gladwell",
    "wishlisted": true
  },
  {
    "bookTitle": "The Tipping Point",
    "bookAuthor": "Malcolm Gladwell",
    "wishlisted": true
  },
  {
    "bookTitle": "Blink",
    "bookAuthor": "Malcolm Gladwell",
    "wishlisted": true
  },
  {
    "bookTitle": "Talking to Strangers",
    "bookAuthor": "Malcolm Gladwell",
    "wishlisted": true
  },
  {
    "bookTitle": "Outliers",
    "bookAuthor": "Malcolm Gladwell",
    "wishlisted": true
  },
  { "bookTitle": "Originals", "bookAuthor": "Adam Grant", "wishlisted": true },
  {
    "bookTitle": "The Element",
    "bookAuthor": "Ken Robinson",
    "wishlisted": true
  },
  {
    "bookTitle": "The Big Short",
    "bookAuthor": "Michael Lewis",
    "wishlisted": true
  },
  {
    "bookTitle": "Boomerang",
    "bookAuthor": "Michael Lewis",
    "wishlisted": true
  },
  {
    "bookTitle": "Flash Boys",
    "bookAuthor": "Michael Lewis",
    "wishlisted": true
  },
  {
    "bookTitle": "Liar's Poker",
    "bookAuthor": "Michael Lewis",
    "wishlisted": true
  },
  {
    "bookTitle": "The New New Thing",
    "bookAuthor": "Michael Lewis",
    "wishlisted": true
  },
  {
    "bookTitle": "The Fifth Risk",
    "bookAuthor": "Michael Lewis",
    "wishlisted": true
  },
  {
    "bookTitle": "Out of Our Minds",
    "bookAuthor": "Ken Robinson",
    "wishlisted": true
  },
  {
    "bookTitle": "The Enigma of Reason",
    "bookAuthor": "Dan Sperber",
    "wishlisted": true
  },
  {
    "bookTitle": "Архипелаг ГУЛАГ",
    "bookAuthor": "Александр Исаевич Солженицын",
    "dropped": true,
    "dropReason": "(was enough after 50%)",
    "summary": "A powerful and eye-opening book that tells the story of the Soviet Union's vast system of forced labor camps, known as the Gulag, during the mid-20th century. Imagine a country where people were punished severely for simply speaking their minds or having different ideas. This is what happened in the Soviet Union, a big country in Europe and Asia. The government, led by a group of powerful people, wanted everyone to think and act the same way. Aleksandr Solzhenitsyn, is like a brave detective. He decided to find out the truth about what was happening in his country. Instead of solving crimes, he uncovered a huge secret - a network of prisons where innocent people were sent for saying or doing things that the government didn't like. These secret prisons were called the Gulag, a place where the government would send regular people - teachers, writers, workers, and even kids - to these faraway, cold, and dark places. People were not sent to the Gulag because they were really bad. It was more like someone didn't like what they said or did, and the government would accuse them of made-up crimes. Life in the Gulag was like being stuck in a really sad and scary fairy tale. There was very little food, and people had to work all day, every day. It was so cold, and there were guards everywhere making sure nobody tried to escape. Families were torn apart, and children were sent to special camps where they had to grow up without their parents. Solzhenitsyn wrote down the stories of the people he met in the Gulag. He wanted the whole world to know about the unfairness and cruelty happening in his country. Through his writing, Solzhenitsyn encouraged people to speak up against injustice, even if it was scary. He believed that if more people knew about the Gulag, they would join together to stop the unfairness. It's like telling everyone about a bully so that others can help stop the bullying. \"The Gulag Archipelago\" is a story about bravery, injustice, and the power of words. It teaches us that even in the darkest times, one person's voice can make a difference. It's a reminder to stand up for what is right and to speak out against unfairness."
  },
  {
    "bookTitle": "On the Origin of Species",
    "bookAuthor": "Charles Darwin",
    "dropped": true,
    "dropReason": "(written in a manner too difficult for me to comprehend)",
    "summary": "Imagine you're in a world of amazing creatures – birds with different beaks, turtles with various shells, and flowers with different colors. Charles Darwin wondered how these fantastic beings came to be. In this book he explained his brilliant idea – evolution. Darwin starts by talking about how farmers and breeders choose the best animals or plants for certain traits, like a farmer picking the biggest potatoes or a breeder choosing the fastest horses. He suggests that nature does something similar, letting the fittest animals and plants survive and pass on their good traits to their babies. Darwin says there are a lot of animals and plants in the world, but there's not enough food and space for everyone. This creates a competition – a struggle for existence. Only the strongest and best-suited survive and have babies. It's like a big race, and only the fastest runners get medals. Darwin explains that every living thing is a bit different from its parents. Imagine you have siblings, and each of you has something special about you – maybe one is taller, and another is faster. This variation is essential for the survival of a species. The coolest part of Darwin's idea is natural selection. Imagine a world where birds try to find the best food. Some birds might have long beaks, and others short. If the best food is deep inside a tree's bark, the birds with long beaks can reach it, survive, and have babies. Over time, more birds with long beaks will be around. This is like nature picking the best tools for the job. Darwin talks more about how species change slowly over time. It's like a story that goes on for many chapters, with each generation adding a little twist. Eventually, the story becomes very different from where it started. On the topic of instinct, Darwin goes over some animals that have some incredible abilities. For example, birds migrating thousands of miles without a map. Darwin suggests that these abilities also come from the slow changes over many generations. It's like learning from mistakes and getting better over time. He also covers hybridism. Sometimes different species can have babies together, but these hybrid babies are often not as strong or healthy. Darwin uses this to show that species are like big families – they might look different, but they're related. He also talks about how it's hard to find all the clues from the past. It's like trying to read a story when some pages are missing. Even though we might not have all the details, the evidence we do have supports the idea of evolution. Closer to the end of the book Darwin looks at how different animals and plants are related. It's like making a family tree for all living things. He also talks about how embryos (baby animals before they are born) of different species look very similar, suggesting a common ancestry."
  },
  {
    "bookTitle": "The Wealth of Nations",
    "bookAuthor": "Adam Smith",
    "dropped": true,
    "dropReason": "(written in a manner too difficult for me to comprehend)",
    "summary": "Adam Smith talks about something he calls the \"invisible hand.\" It's like magic! He says that when people work to make money for themselves, it helps everyone. If a baker makes tasty bread and sells it, not only does he make money, but the people in the village get to eat delicious bread. So, by chasing their own interests, people unknowingly help others. It's like magic fingers making everything better! Next, Smith thinks that if everyone focuses on what they are good at, instead of trying to do everything, the whole village becomes more efficient. Imagine if everyone in a village tried to be a baker, a farmer, and a blacksmith at the same time. Things would be chaotic! But if they specialise in what they're good at, like one person baking, another farming, and another making tools, everything runs smoothly. Supply and Demand - If everyone in the village wants a toy, the toy makers will make a lot, and the price will be lower. But if no one wants toys, the price will be higher because they are rare. That's supply and demand. When something is rare and many people want it, the price goes up. But if there's a lot of it, the price goes down. Smith also talks about money. Money makes trading easier. Instead of swapping goods directly, like trading a potato for a shoe, people can use money. It's like a common language for trading. If you sell your potatoes for money, you can use that money to buy whatever you want. Additionally, Adam Smith believes that governments should not control everything. He thinks governments should protect people and make sure everyone plays fair, but they shouldn't tell people how to do everything. It's like having a referee in a game. They make sure the game is fair, but they don't play it for you. Finally, Smith talks about wealth, and he doesn't just mean gold and silver. He says real wealth is having a lot of things that make life better—like good roads, schools, and happy people. It's not just about having piles of gold."
  },
  {
    "bookTitle": "Maps of Meaning - The Architecture of Belief",
    "bookAuthor": "Jordan B. Peterson",
    "dropped": true,
    "dropReason": "(written in a manner too difficult for me to comprehend)",
    "summary": "A book that explores the deep and complex nature of human beliefs, emotions, and the stories we tell ourselves to make sense of the world. Imagine life as a grand journey. You, me, and everyone else are like explorers, trying to find our way in a vast and sometimes confusing world. Jordan Peterson talks about how we all create \"maps\" to help us navigate this journey. These maps are not like the ones you use to find your way on the street; they are more like mental guides that tell us what's important and how we should behave. In our journey, there are dragons – not real ones, but metaphorical ones. These dragons are the challenges and problems we face in life. They could be anything from a difficult homework assignment to a big personal problem. Heroes, on the other hand, are the brave people who face these challenges and overcome them. Peterson talks about how ancient stories and myths often feature heroes facing dragons, teaching us that challenges are a natural part of life. Next, Peterson explores the ideas of chaos and order. Too much chaos is confusing, but too much order can be boring. Peterson suggests that finding the right balance between chaos and order is essential for a happy and meaningful life. He also covers the Power of Stories - they are more than just entertainment. They are like guides for how we should live. Peterson believes that stories help us make sense of the world, giving us a structure to understand what is right and wrong, good and bad. After that, Peterson dives into the deep waters of truth and meaning. He suggests that what we believe to be true is often linked to what we find meaningful. For example, if you believe being kind is good, it's because you find meaning in kindness. Our beliefs and values shape our maps, guiding us through the journey of life. And life is full of mysteries and things we don't understand. Peterson talks about the importance of facing the unknown, just like explorers stepping into uncharted territory. Instead of being afraid, he encourages us to be curious and open-minded, ready to learn and grow. Afterwards, he speak about the importance of responsibility. Peterson emphasizes that we have the power to shape our lives, and with that power comes responsibility. Making good choices and facing challenges head-on is part of growing up and becoming the hero of our own story. Peterson believes that finding meaning and purpose in our lives is crucial. This doesn't mean we all have to do something extraordinary, like become a famous scientist or a superhero. It means finding something that feels important and fulfilling to us personally, whether it's helping others, creating art, or being a good friend. Like a caterpillar turning into a butterfly, Peterson talks about the process of becoming a better person. It involves facing challenges, learning from mistakes, and growing wiser. He believes that by striving to be better, we contribute to making the world a better place. Finally, Peterson explores the idea that our individual journeys are connected. Just like pieces of a puzzle, our stories and experiences overlap and interact. Understanding this connection can help us relate to and appreciate others, fostering a sense of community and shared purpose."
  },
  {
    "bookTitle": "Chip War",
    "bookAuthor": "Chris Miller",
    "dropped": true,
    "dropReason": "(did not capture my attention)"
  },
  {
    "bookTitle": "Artificial Unintelligence",
    "bookAuthor": "Meredith Broussard",
    "dropped": true,
    "dropReason": "(did not capture my attention)",
    "summary": "This book explores the world of artificial intelligence (AI) and challenges some common misconceptions. Firstly, Broussard talked about the idea that AI can do everything better than humans. She said, \"Hold on a second! AI is not a magical solution to all our problems. It's not as smart as you think.\" She wanted people to understand that computers and AI have their limits and can't replace the unique things humans can do. She also explained that sometimes people trust AI too much. Imagine if your friend told you a joke, and you laughed, but if a robot told you the same joke, it might not feel right. That's because AI doesn't really understand things the way humans do. It's like a super-fast calculator that can't grasp the emotions and meanings behind things. Another important point that Broussard made was about data. She said, \"AI needs a lot of information to learn, but sometimes the data it learns from is biased.\" What does biased mean? Well, it's like if you only ate your favorite food every day and never tried anything else. Your taste would be a bit biased, right? AI can be like that too, learning from data that might not represent everyone fairly. Broussard wanted people to be aware that just because something uses AI, doesn't mean it's always the best or fairest choice. She encouraged us to think critically about the technology we use and not just believe it's perfect. In her book, she also talked about how some people think technology can solve big problems like poverty or climate change. But she reminded us that real solutions involve more than just fancy gadgets. Humans need to work together and think carefully about the choices they make. She didn't want us to be scared of technology, though. Instead, Broussard encouraged us to be curious and ask questions. If a robot does something cool, we should wonder how it works and not just accept it without thinking."
  },
  {
    "bookTitle": "Drift into Failure",
    "bookAuthor": "Sidney Dekker",
    "dropped": true,
    "dropReason": "(a bit too dry)",
    "summary": "\"Drift into Failure\" is like a guidebook for exploring the world of accidents. It's not about blaming someone but understanding how things can go wrong and making our adventures safer and more enjoyable. Just like in a game, we learn, adapt, and strive to be better players in the adventure of life. Accidents are like unexpected adventures. Sometimes, things don't go the way we plan, just like a surprise twist in a story. In this book, there's a cool idea that accidents aren't caused by bad guys. Instead, they happen when things get really complicated, like a puzzle with lots of pieces. One small mistake can lead to a chain of events, just like knocking down dominoes. Sometimes, it's the small things that start the whole adventure of accidents. Like a tiny pebble causing a big ripple in a pond. When you make a mistake, it's not about blaming someone. It's about learning from it, so you don't make the same mistake again. If you trip and fall, what do you do? You get up and keep going! The book talks about how important it is to bounce back after an accident and make things better. People make mistakes, but it's not because they want to. The book explains how our nature sometimes plays a role. Additionally, in this book, they use hindsight to understand accidents better, like watching a replay of a game to see what went wrong. Just like crossing the street, it's important to be mindful and watch out for potential dangers. In the book, being watchful helps prevent accidents. Communication is key! The book talks about how good communication can prevent accidents. Finally, the book suggests preparing for the unexpected, like having an umbrella when it might rain. Moreover, being flexible and adapting to change can help avoid accidents."
  },
  {
    "bookTitle": "Fahrenheit 451",
    "bookAuthor": "Ray Bradbury",
    "dropped": true,
    "dropReason": "(although the message is vital and known to me, the style of the book was not captivating enough)"
  },
  {
    "bookTitle": "The Alchemist",
    "bookAuthor": "Paulo Coelho",
    "dropped": true,
    "dropReason": "(lost interest in the story)"
  },
  {
    "bookTitle": "A Promised Land",
    "bookAuthor": "Barack Obama",
    "dropped": true,
    "dropReason": "(biographies usually do not keep my attention)"
  }
]
